import tkinter as tk
from tkinter import filedialog
from sklearn.ensemble import RandomForestClassifier, AdaBoostClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC
from sklearn.tree import DecisionTreeClassifier
from sklearn.neural_network import MLPClassifier
from sklearn.ensemble import VotingClassifier
from sklearn.impute import SimpleImputer
from PIL import Image, ImageTk
import csv
import os

class HeartDiseasePredictionApp:
    def __init__(self, root):
        self.root = root
        self.root.title("Predict heart disease")
        self.root.geometry("1400x720")
        self.widgets()
        self.imputer = SimpleImputer(strategy='mean')
        self.fit()  # Fit the model when the app starts

        

    def widgets(self):
        greeting = tk.Label(self.root, text="Predict heart disease", fg="black", font=("Arial", 16))
        greeting.place(x=10, y=10)

        self.frame1 = tk.Frame(self.root, width=500, height=500, bg="#001466")
        self.frame1.place(x=30, y=50)

        frame2 = tk.Frame(self.root, width=370, height=500, bg="#612180")
        frame2.place(x=900, y=50)

        frame2_text = tk.Label(frame2, text="INPUT", fg="white", font=("Arial", 20), bg="#612180")
        frame2_text.place(x=30, y=20)

        input_labels = ["Age", "Sex", "cp", "trestbps", "thalach", "exang", "slope"]
        self.input_entries = []

        for i, label_text in enumerate(input_labels):
            label = tk.Label(frame2, text=label_text, fg="white", font=("Arial", 14), bg="#612180")
            label.place(x=20, y=70 + i * 40)

            var = tk.StringVar()
            var.set("0")
            entry = tk.Entry(frame2, textvariable=var, font=("Arial", 14), bg="white")
            entry.place(x=120, y=70 + i * 40)

            self.input_entries.append(entry)

            

        frame3 = tk.Frame(self.root, width=1065, height=220, bg="#50E943")
        frame3.place(x=30, y=550)

        frame4 = tk.Frame(self.root, width=970, height=180, bg="#FFFFFF")
        frame4.place(x=55, y=560)

        openfile_button = tk.Button(frame4, text="Click Me", command=self.open_file, font=("Arial", 18), bg="#87ceeb", fg="black")
        openfile_button.grid(row=0, column=0, pady=30, padx=120)

        predict_button = tk.Button(frame4, text="Predict", command=self.predict, font=("Arial", 18), bg="#A577BB", fg="black")
        predict_button.grid(row=0, column=1, pady=30, padx=120)

        self.predict_label = tk.Label(frame4, text="Predict: unknown", font=("Arial", 22), bg="#FFFFFF", fg="black")
        self.predict_label.grid(row=0, column=2, pady=30, padx=30)

        # กำหนดตัวประมาณการของคุณแยกต่างหาก
        rf_classifier = RandomForestClassifier()
        lr_classifier = LogisticRegression(max_iter=1000)
        nb_classifier = GaussianNB()
        svm_classifier = SVC(probability=True)
        dt_classifier = DecisionTreeClassifier()
        mlp_classifier = MLPClassifier(max_iter=500, solver='adam', learning_rate='adaptive')
        adaboost_classifier = AdaBoostClassifier(algorithm='SAMME')

        # ส่งตัวประมาณการไปยัง VotingClassifier
        classifiers = [('Random Forest', rf_classifier),
                    ('Logistic Regression', lr_classifier),
                    ('Naive Bayes', nb_classifier),
                    ('SVM', svm_classifier),
                    ('Decision Tree', dt_classifier),
                    ('MLP', mlp_classifier),
                    ('Adaboost', adaboost_classifier)]

        self.voting_classifier = VotingClassifier(estimators=classifiers, voting='soft')


        self.data = [
            ["Age", "Sex", "cp", "trestbps", "thalach", "exang", "slope", "target"],     
            [63, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 145, 150, "ไม่เจ็บ", "มาก", "มีโรค"],
            [37, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 187, "ไม่เจ็บ", "มาก", "มีโรค"],
            [41, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 172, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [56, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 178, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [57, "ชาย", "เจ็บแน่นทรวงอกปกติ", 120, 163, "เจ็บ", "น้อย", "มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 148, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [56, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 140, 153, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [44, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 173, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [52, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 172, 162, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [57, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 150, 174, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [54, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 160, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [48, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 130, 139, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [49, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 171, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [64, "หญิง", "ไม่มีอาการ", 110, 144, "เจ็บ", "ปานกลาง", "มีโรค"],
            [58, "ชาย", "ไม่มีอาการ", 150, 162, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [50, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 120, 158, "ไม่เจ็บ", "ไม่เจ็บ", "มีโรค"],
            [58, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 120, 172, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [66, "ชาย", "ไม่มีอาการ", 150, 114, "ไม่เจ็บ", "ไม่เจ็บ", "มีโรค"],
            [43, "หญิง", "เจ็บแน่นทรวงอกปกติ", 150, 171, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [69, "ชาย", "ไม่มีอาการ", 140, 151, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [59, "หญิง", "เจ็บแน่นทรวงอกปกติ", 135, 161, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [44, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 179, "เจ็บ", "น้อย", "มีโรค"],
            [42, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 178, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [61, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 150, 137, "เจ็บ", "ปานกลาง", "มีโรค"],
            [40, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 178, "เจ็บ", "น้อย", "มีโรค"],
            [71, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 160, 162, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [59, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 150, 157, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [51, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 110, 123, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [65, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 140, 157, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [53, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 152, "ไม่เจ็บ", "ไม่เจ็บ", "มีโรค"],
            [41, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 105, 168, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [65, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 140, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [44, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 188, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [54, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 125, 152, "ไม่เจ็บ", "มาก", "มีโรค"],
            [51, "หญิง", "ไม่มีอาการ", 125, 125, "เจ็บ", "น้อย", "มีโรค"],
            [46, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 142, 160, "เจ็บ", "ไม่เจ็บ", "มีโรค"],
            [54, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 135, 170, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [54, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 150, 165, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [65, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 155, 148, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [65, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 160, 151, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [51, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 140, 142, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [48, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 180, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [45, "หญิง", "เจ็บแน่นทรวงอกปกติ", 104, 148, "เจ็บ", "ปานกลาง", "มีโรค"],
            [53, "ชาย", "เจ็บแน่นทรวงอกปกติ", 130, 143, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [39, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 182, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [52, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 172, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [44, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 180, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [47, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 138, 156, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [53, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 128, 115, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [53, "ชาย", "เจ็บแน่นทรวงอกปกติ", 138, 160, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [51, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 130, 149, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [66, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 151, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [62, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 146, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [44, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 108, 175, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [63, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 135, 172, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [52, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 134, 158, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [48, "หญิง", "เจ็บแน่นทรวงอกปกติ", 122, 186, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [45, "หญิง", "เจ็บแน่นทรวงอกปกติ", 115, 185, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [34, "หญิง", "ไม่มีอาการ", 118, 174, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [57, "ชาย", "เจ็บแน่นทรวงอกปกติ", 128, 159, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [71, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 110, 130, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [54, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 108, 156, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [52, "หญิง", "ไม่มีอาการ", 118, 190, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [41, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 135, 132, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [58, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 165, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [35, "ชาย", "เจ็บแน่นทรวงอกปกติ", 138, 182, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [51, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 100, 143, "เจ็บ", "ปานกลาง", "มีโรค"],
            [45, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 175, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [44, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 170, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [62, "ชาย", "เจ็บแน่นทรวงอกปกติ", 124, 163, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [54, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 120, 147, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [51, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 94, 154, "เจ็บ", "น้อย", "มีโรค"],
            [29, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 202, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [51, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 186, "เจ็บ", "น้อย", "มีโรค"],
            [43, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 122, 165, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [55, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 135, 161, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [51, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 125, 166, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [59, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 140, 164, "เจ็บ", "น้อย", "มีโรค"],
            [52, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 128, 184, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [58, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 105, 154, "เจ็บ", "ปานกลาง", "มีโรค"],
            [41, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 112, 179, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [45, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 128, 170, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [60, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 102, 160, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [52, "หญิง", "ไม่มีอาการ", 152, 178, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [42, "ชาย", "เจ็บแน่นทรวงอกปกติ", 102, 122, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [67, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 115, 160, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [68, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 118, 151, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [46, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 101, 156, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [54, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 110, 158, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [58, "ชาย", "เจ็บแน่นทรวงอกปกติ", 100, 122, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [48, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 124, 175, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกปกติ", 132, 168, "เจ็บ", "น้อย", "มีโรค"],
            [52, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 138, 169, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [54, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 132, 159, "เจ็บ", "น้อย", "มีโรค"],
            [45, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 112, 138, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [53, "หญิง", "เจ็บแน่นทรวงอกปกติ", 142, 111, "เจ็บ", "น้อย", "มีโรค"],
            [62, "ชาย", "เจ็บแน่นทรวงอกปกติ", 140, 157, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [52, "หญิง", "เจ็บแน่นทรวงอกปกติ", 108, 147, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [43, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 162, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [53, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 173, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [42, "หญิง", "ไม่มีอาการ", 148, 178, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [59, "หญิง", "ไม่มีอาการ", 178, 145, "ไม่เจ็บ", "มาก", "มีโรค"],
            [63, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 140, 179, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [42, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 120, 194, "ไม่เจ็บ", "มาก", "มีโรค"],
            [50, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 129, 163, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [68, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 120, 115, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [69, "หญิง", "ไม่มีอาการ", 160, 131, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [45, "ชาย", "เจ็บแน่นทรวงอกปกติ", 138, 152, "เจ็บ", "ปานกลาง", "มีโรค"],
            [50, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 162, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [50, "ชาย", "เจ็บแน่นทรวงอกปกติ", 110, 159, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [64, "ชาย", "เจ็บแน่นทรวงอกปกติ", 180, 154, "เจ็บ", "น้อย", "มีโรค"],
            [57, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 150, 173, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [64, "ชาย", "เจ็บไม่ใช่จากทรวงอกไม่ปกติ", 140, 133, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [43, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 161, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [55, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 155, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [37, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 120, 170, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [41, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 168, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [56, "หญิง", "ไม่มีอาการ", 120, 162, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [46, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 105, 172, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [46, "ชาย", "เจ็บแน่นทรวงอกปกติ", 138, 152, "เจ็บ", "ปานกลาง", "มีโรค"],
            [64, "ชาย", "เจ็บแน่นทรวงอกปกติ", 130, 122, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [59, "หญิง", "เจ็บแน่นทรวงอกปกติ", 138, 182, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [41, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 112, 172, "เจ็บ", "น้อย", "มีโรค"],
            [54, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 108, 167, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [39, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 94, 179, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [34, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 118, 192, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [47, "หญิง", "เจ็บแน่นทรวงอกปกติ", 112, 143, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [67, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 152, 172, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [52, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 136, 169, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [74, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 121, "เจ็บ", "น้อย", "มีโรค"],
            [54, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 160, 163, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [49, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 134, 162, "ไม่เจ็บ", "ปานกลาง", "มีโรค"],
            [42, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 162, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [41, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 110, 153, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [41, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 126, 163, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [49, "ชาย", "เจ็บแน่นทรวงอกปกติ", 130, 163, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [60, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 120, 96, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [62, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 128, 140, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 126, "เจ็บ", "ปานกลาง", "มีโรค"],
            [64, "หญิง", "เจ็บแน่นทรวงอกปกติ", 128, 105, "เจ็บ", "ปานกลาง", "มีโรค"],
            [51, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 120, 157, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [43, "หญิง", "เจ็บแน่นทรวงอกปกติ", 115, 181, "ไม่เจ็บ", "มาก", "มีโรค"],
            [42, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 120, 173, "ไม่เจ็บ", "มาก", "มีโรค"],
            [67, "ชาย", "เจ็บแน่นทรวงอกปกติ", 106, 142, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [76, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 140, 116, "ไม่เจ็บ", "มาก", "มีโรค"],
            [70, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 156, 143, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [44, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 118, 149, "ไม่เจ็บ", "มาก", "มีโรค"],
            [60, "ชาย", "ไม่มีอาการ", 150, 171, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [44, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 120, 169, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [42, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 150, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [66, "หญิง", "เจ็บแน่นทรวงอกปกติ", 160, 138, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [71, "ชาย", "เจ็บแน่นทรวงอกปกติ", 112, 125, "ไม่เจ็บ", "มาก", "มีโรค"],
            [64, "หญิง", "ไม่มีอาการ", 170, 155, "ไม่เจ็บ", "มาก", "มีโรค"],
            [66, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 146, 152, "ไม่เจ็บ", "มาก", "มีโรค"],
            [39, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 138, 152, "ไม่เจ็บ", "มาก", "มีโรค"],
            [58, "ชาย", "เจ็บแน่นทรวงอกปกติ", 130, 131, "ไม่เจ็บ", "มาก", "มีโรค"],
            [47, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 179, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [35, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 122, 174, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 125, 144, "ไม่เจ็บ", "มาก", "มีโรค"],
            [56, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 163, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [56, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 169, "ไม่เจ็บ", "ไม่ทราบ", "มีโรค"],
            [55, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 132, 166, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [41, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 182, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [38, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 138, 173, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [38, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 138, 173, "ไม่เจ็บ", "น้อย", "มีโรค"],
            [67, "หญิง", "เจ็บแน่นทรวงอกปกติ", 160, 108, "เจ็บ", "มาก", "ไม่มีโรค"],
            [67, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 129, "เจ็บ", "มาก", "ไม่มีโรค"],
            [62, "ชาย", "เจ็บแน่นทรวงอกปกติ", 140, 160, "ไม่เจ็บ", "ไม่มากไม่น้อย", "ไม่มีโรค"],
            [63, "หญิง", "เจ็บแน่นทรวงอกปกติ", 130, 147, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [53, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 155, "เจ็บ", "มาก", "ไม่มีโรค"],
            [56, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 130, 142, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [48, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 110, 168, "ไม่เจ็บ", "ไม่มากไม่น้อย", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 160, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 132, 173, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [60, "หญิง", "เจ็บแน่นทรวงอกปกติ", 130, 132, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [40, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 114, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [60, "หญิง", "เจ็บแน่นทรวงอกปกติ", 117, 160, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [64, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 158, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [43, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 120, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกปกติ", 150, 112, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [55, "หญิง", "เจ็บแน่นทรวงอกปกติ", 132, 132, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [65, "ชาย", "เจ็บแน่นทรวงอกปกติ", 150, 114, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [61, "ชาย", "เจ็บแน่นทรวงอกปกติ", 130, 169, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 112, 165, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [50, "หญิง", "เจ็บแน่นทรวงอกปกติ", 150, 128, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [44, "หญิง", "เจ็บแน่นทรวงอกปกติ", 112, 153, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [60, "หญิง", "เจ็บแน่นทรวงอกปกติ", 130, 144, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [54, "หญิง", "เจ็บแน่นทรวงอกปกติ", 124, 109, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [50, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 163, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [41, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 158, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [51, "ชาย", "เจ็บแน่นทรวงอกปกติ", 130, 142, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกปกติ", 128, 131, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [54, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 113, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [60, "หญิง", "เจ็บแน่นทรวงอกปกติ", 145, 142, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [60, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 155, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [59, "หญิง", "เจ็บแน่นทรวงอกปกติ", 170, 140, "เจ็บ", "มาก", "ไม่มีโรค"],
            [46, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 150, 147, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [67, "หญิง", "เจ็บแน่นทรวงอกปกติ", 125, 163, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [62, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 99, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [65, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 158, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [44, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 177, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [60, "หญิง", "เจ็บแน่นทรวงอกปกติ", 125, 141, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกปกติ", 150, 111, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [68, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 180, 150, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [62, "ชาย", "เจ็บแน่นทรวงอกปกติ", 160, 145, "ไม่เจ็บ", "ไม่มากไม่น้อย", "ไม่มีโรค"],
            [52, "หญิง", "เจ็บแน่นทรวงอกปกติ", 128, 161, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [59, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 142, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [60, "ชาย", "เจ็บแน่นทรวงอกปกติ", 150, 157, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [49, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 120, 139, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [59, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 162, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [57, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 128, 150, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [61, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 140, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [39, "หญิง", "เจ็บแน่นทรวงอกปกติ", 118, 140, "เจ็บ", "มาก", "ไม่มีโรค"],
            [61, "ชาย", "เจ็บแน่นทรวงอกปกติ", 145, 148, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [56, "หญิง", "เจ็บแน่นทรวงอกปกติ", 125, 149, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [43, "หญิง", "เจ็บแน่นทรวงอกปกติ", 132, 132, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [62, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 138, 138, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [63, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 130, 134, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [65, "ชาย", "เจ็บแน่นทรวงอกปกติ", 135, 127, "ไม่เจ็บ", "มาก", "ไม่มีโรค"],
            [48, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 130, 180, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [63, "ชาย", "เจ็บไม่ใช่จากทรวงอก", 130, 122, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [55, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 111, "เจ็บ", "มาก", "ไม่มีโรค"],
            [65, "หญิง", "ไม่มีอาการ", 138, 174, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [56, "ชาย", "เจ็บแน่นทรวงอกปกติ", 200, 133, "เจ็บ", "มาก", "ไม่มีโรค"],
            [54, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 126, "เจ็บ", "เจ็บ", "ไม่มีโรค"],
            [70, "หญิง", "เจ็บแน่นทรวงอกปกติ", 145, 125, "เจ็บ", "มาก", "ไม่มีโรค"],
            [62, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 120, 103, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [35, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 130, "เจ็บ", "เจ็บ", "ไม่มีโรค"],
            [59, "หญิง", "ไม่มีอาการ", 170, 159, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [64, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 125, 131, "เจ็บ", "เจ็บ", "ไม่มีโรค"],
            [47, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 108, 152, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกปกติ", 165, 124, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [55, "หญิง", "เจ็บแน่นทรวงอกปกติ", 160, 145, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [64, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 96, "เจ็บ", "มาก", "ไม่มีโรค"],
            [70, "หญิง", "เจ็บแน่นทรวงอกปกติ", 130, 109, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [51, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 173, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกปกติ", 125, 171, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [60, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 170, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [77, "หญิง", "เจ็บแน่นทรวงอกปกติ", 125, 162, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [35, "หญิง", "เจ็บแน่นทรวงอกปกติ", 126, 156, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [70, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 160, 112, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [59, "ชาย", "เจ็บแน่นทรวงอกปกติ", 174, 143, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [64, "หญิง", "เจ็บแน่นทรวงอกปกติ", 145, 132, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกปกติ", 152, 88, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [56, "หญิง", "เจ็บแน่นทรวงอกปกติ", 132, 105, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [48, "หญิง", "เจ็บแน่นทรวงอกปกติ", 124, 166, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [56, "ชาย", "เจ็บแน่นทรวงอกปกติ", 134, 150, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [66, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 160, 120, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [54, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 192, 195, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [69, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 146, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [51, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 122, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [43, "หญิง", "เจ็บแน่นทรวงอกปกติ", 132, 143, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [62, "ชาย", "เจ็บแน่นทรวงอกปกติ", 138, 106, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [67, "หญิง", "เจ็บแน่นทรวงอกปกติ", 100, 125, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [59, "หญิง", "ไม่มีอาการ", 160, 125, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [45, "หญิง", "เจ็บแน่นทรวงอกปกติ", 142, 147, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกปกติ", 128, 130, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [50, "หญิง", "เจ็บแน่นทรวงอกปกติ", 144, 126, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [62, "ชาย", "เจ็บแน่นทรวงอกปกติ", 150, 154, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [38, "หญิง", "ไม่มีอาการ", 120, 182, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [66, "ชาย", "เจ็บแน่นทรวงอกปกติ", 178, 165, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [52, "หญิง", "เจ็บแน่นทรวงอกปกติ", 112, 160, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [53, "หญิง", "เจ็บแน่นทรวงอกปกติ", 123, 95, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [63, "ชาย", "เจ็บแน่นทรวงอกปกติ", 108, 169, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [54, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 108, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [66, "หญิง", "เจ็บแน่นทรวงอกปกติ", 112, 132, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [55, "ชาย", "เจ็บแน่นทรวงอกปกติ", 180, 117, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [49, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 118, 126, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [54, "หญิง", "เจ็บแน่นทรวงอกปกติ", 122, 116, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [56, "หญิง", "เจ็บแน่นทรวงอกปกติ", 130, 103, "เจ็บ", "เจ็บ", "ไม่มีโรค"],
            [46, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 144, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [61, "หญิง", "ไม่มีอาการ", 134, 145, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [67, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 71, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกปกติ", 100, 156, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [47, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 118, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [52, "หญิง", "เจ็บแน่นทรวงอกปกติ", 125, 168, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกปกติ", 146, 105, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 124, 141, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [58, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 136, 152, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [61, "หญิง", "เจ็บแน่นทรวงอกปกติ", 138, 125, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [42, "หญิง", "เจ็บแน่นทรวงอกปกติ", 136, 125, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [52, "หญิง", "เจ็บแน่นทรวงอกปกติ", 128, 156, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [59, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 126, 134, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [40, "หญิง", "เจ็บแน่นทรวงอกปกติ", 152, 181, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [61, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 138, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [46, "หญิง", "เจ็บแน่นทรวงอกปกติ", 140, 120, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [59, "หญิง", "ไม่มีอาการ", 134, 162, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 154, 164, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกปกติ", 110, 143, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [55, "ชาย", "เจ็บแน่นทรวงอกปกติ", 128, 130, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [61, "หญิง", "เจ็บแน่นทรวงอกไม่ปกติ", 148, 161, "ไม่เจ็บ", "น้อย", "ไม่มีโรค"],
            [58, "หญิง", "เจ็บแน่นทรวงอกปกติ", 114, 140, "ไม่เจ็บ", "มาก", "ไม่มีโรค"],
            [58, "ชาย", "เจ็บแน่นทรวงอกปกติ", 170, 146, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [67, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 152, 150, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [44, "หญิง", "เจ็บแน่นทรวงอกปกติ", 120, 144, "เจ็บ", "มาก", "ไม่มีโรค"],
            [63, "หญิง", "เจ็บไม่ใช่จากทรวงอก", 140, 144, "เจ็บ", "น้อย", "ไม่มีโรค"],
            [63, "ชาย", "เจ็บแน่นทรวงอกปกติ", 124, 136, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [59, "หญิง", "เจ็บแน่นทรวงอกปกติ", 164, 90, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [57, "ชาย", "เจ็บแน่นทรวงอกปกติ", 140, 123, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [45, "หญิง", "ไม่มีอาการ", 110, 132, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [68, "หญิง", "เจ็บแน่นทรวงอกปกติ", 144, 141, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [57, "หญิง", "เจ็บแน่นทรวงอกปกติ", 130, 115, "เจ็บ", "ปานกลาง", "ไม่มีโรค"],
            [57, "ชาย", "เจ็บแน่นทรวงอกไม่ปกติ", 130, 174, "ไม่เจ็บ", "ปานกลาง", "ไม่มีโรค"]
        ]   

        self.update_frame1()  # เรียกใช้เมธอดเพื่อแสดงข้อมูลในเฟรมแรก

    # เมธอดสำหรับเปิดไฟล์ CSV
    def open_file(self):
        file_path = filedialog.askopenfilename(filetypes=[("CSV files", "*.csv")])
        if file_path:
            self.load_data_from_csv(file_path)

        
    def fit(self):
        try:
            X = []
            y = []
            for row in self.data[1:]:
                # Convert non-numeric values to numeric representations
                sex_map = {"ชาย": 1, "หญิง": 0}
                cp_map = {"เจ็บแน่นทรวงอกปกติ": 0, "เจ็บแน่นทรวงอกไม่ปกติ": 1, "เจ็บไม่ใช่จากทรวงอก": 2, "ไม่มีอาการ": 3}
                exang_map = {"เจ็บ": 1, "ไม่เจ็บ": 0}
                slope_map = {"มาก": 0, "ปานกลาง": 1, "น้อย": 2}

                # Map non-numeric values to numeric representations
                sex = sex_map.get(row[1])
                cp = cp_map.get(row[2])
                exang = exang_map.get(row[5])
                slope = slope_map.get(row[6])

                # Append the data to X and y
                X.append([row[0], sex, cp, row[3], row[4], exang, slope])
                y.append(row[7])

            # Impute missing values
            X = self.imputer.fit_transform(X)

            self.voting_classifier.fit(X, y)
        except Exception as e:
            print("Error occurred while fitting the classifier:", e)


    
    def predict(self):
        try:
            data = []
            for i, entry in enumerate(self.input_entries):
                entry_value = entry.get().strip()
                if entry_value == "":
                    raise ValueError("Incomplete input data")

                # Mapping categorical values to numeric representations
                if i == 1:  
                    sex_map = {"ชาย": 1, "หญิง": 0}
                    data.append(sex_map.get(entry_value))
                elif i == 2:  
                    cp_map = {"เจ็บแน่นทรวงอกปกติ": 0, "เจ็บแน่นทรวงอกไม่ปกติ": 1, "เจ็บไม่ใช่จากทรวงอก": 2, "ไม่มีอาการ": 3}
                    data.append(cp_map.get(entry_value))
                elif i == 5:  
                    exang_map = {"เจ็บ": 1, "ไม่เจ็บ": 0}
                    data.append(exang_map.get(entry_value))
                elif i == 6:  
                    slope_map = {"มาก": 0, "ปานกลาง": 1, "น้อย": 2}
                    data.append(slope_map.get(entry_value))
                else:
                    data.append(float(entry_value))  

            self.fit()  # Ensure that the model is fitted before prediction

            # Get the estimators from the voting classifier
            estimators = self.voting_classifier.estimators_
            
            # Make predictions using each estimator
            predictions = []

            for estimator in estimators:
                # Check if the estimator is a string, if so, skip it
                if isinstance(estimator, str):
                    continue
                
                prediction = estimator.predict([data])[0]
                predictions.append(prediction)

            # Calculate the majority vote
            prediction = max(set(predictions), key=predictions.count)

            prediction_label = "มีโรค" if prediction == 0 else "ไม่มีโรค"
            self.predict_label.config(text=f"Predict: {prediction_label}")

        except ValueError as ve:
            print("Error:", ve)





    def load_data_from_csv(self, csv_file):
        try:
            with open(csv_file, 'r') as file:
                reader = csv.reader(file)
                raw_data = [row for row in reader]  # Read data from CSV file

            headers = raw_data[0]  # Use the first row as headers

            # Convert data from string to appropriate types
            self.data = [headers] + [[int(cell) if i < 4 else float(cell) for i, cell in enumerate(row)] for row in raw_data[1:]]

            self.update_frame1()  # Update the frame in GUI with the loaded data
        except FileNotFoundError:
            print(f"Error: CSV file '{csv_file}' not found.")

    def update_frame1(self):
        for widget in self.frame1.winfo_children():
            widget.destroy()  # ลบวิดเจ็ตทั้งหมดออกจาก Frame ที่กำลังใช้งาน

        for i, row in enumerate(self.data):
            for j, value in enumerate(row):
                if j == 2:  # ตรวจสอบว่าเรากำลังจัดการกับคอลัมน์ที่ 3 หรือไม่
                    label_width = 20  # กำหนดความกว้างของ Label ในคอลัมน์ที่ 3
                else:
                    label_width = 10  # กำหนดความกว้างของ Label ในคอลัมน์อื่น ๆ
                label = tk.Label(self.frame1, width=label_width, height=1, text=str(value), bg="#FFFFFF", fg="black")
                label.grid(row=i, column=j, padx=10, pady=10)  # จัดวาง Label ในตำแหน่งที่เหมาะสมใน Frame
                if i == 0:
                    label.configure(bg="#F1D3FF")  # ตั้งค่าสีพื้นหลังของ Label ในแถวแรกของตารางเป็นสีเทาอ่อน




def main():
    root = tk.Tk()  # สร้างหน้าต่างหลักของแอปพลิเคชัน
    app = HeartDiseasePredictionApp(root)  # สร้างแอปพลิเคชันโดยใช้หน้าต่างหลักที่สร้างขึ้นมา
    root.mainloop()  # เริ่มการทำงานของแอปพลิเคชัน

if __name__ == "__main__":
    main()  # เรียกฟังก์ชัน main เพื่อเริ่มต้นการทำงานของโปรแกรม
